Revit 2026 API

# LinearArrayGetMinimumSize Method

---

Returns the minimum size for a linear array based on the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static int GetMinimumSize(
	Document document
)
```
```vb
Public Shared Function GetMinimumSize (
	document As Document
) As Integer
```
```cpp
public:
static int GetMinimumSize(
	Document^ document
)
```
```fsharp
static member GetMinimumSize :
        document : Document -> int
```

#### Parameters

document Document
     The document.

#### Return Value

Int32 The minimum size of an array.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This value is 2 in projects and 0 in families.

#### Reference

LinearArray Class

Autodesk.Revit.DB Namespace